import Image from "next/image";

export default function AboutArioContent() {
  return (
    <section className="w-full py-[96px]  flex justify-center items-center bg-black">
      <div className="w-[720px] flex flex-col">
        {/* Main Title */}
        <h2 className="title-sm-demibold text-gray-25 mb-5">
          آریو، نشان‌دهنده نوآوری و هوشمندی در دنیای فناوری‌های صوتی و هوشمند
        </h2>

        <p className="text-lg-regular text-textTertiary">
          در آریو، ما به قدرت هوش مصنوعی برای تغییر دنیای امروز و ساخت دنیایی
          متصل و هوشمندتر اعتقاد داریم. هدف ما خلق راه‌حل‌های نوآورانه است که
          زندگی فردی و جامعۀ امروز را آسان‌تر، هوشمندتر و لذت‌بخش‌تر کند. از
          ابتدای تأسیس، تمرکز ما بر توسعه فناوری‌هایی است که نه تنها کارآمد
          هستند، بلکه به بهبود کیفیت زندگی، امنیت و راحتی کاربران کمک می‌کنند.
        </p>

        <h3 className="title-sm-demibold text-gray-25 mt-8">
          مأموریت و چشم‌انداز ما
        </h3>

        <p className="text-lg-regular text-textTertiary mt-4">
          مأموریت آریو، مجهز کردن افراد و کسب‌وکارها با فناوری‌های صوتی و هوشمند
          است. ما مایلیم دنیایی بسازیم که در آن فناوری، همچون یک همکار وفادار،
          در کنار شما باشد و به نیازهای متنوع و روزمره‌تان پاسخ دهد. چشم‌انداز
          ما، تبدیل شدن به برترین و معتبر‌ترین ارائه‌دهنده دستیاران صوتی و
          فناوری‌های هوشمند در منطقه است، که هر فرد بتواند به راحتی به اطلاعات،
          خدمات و امکانات پیشرفته دسترسی داشته باشد.
        </p>

        <h3 className="title-sm-demibold text-gray-25 mt-8">خدمات و محصولات</h3>

        <div className="text-lg-regular text-textTertiary mt-8">
          <p className="mb-4">
            در حال حاضر، آریو با بهره‌گیری از فناوری‌های پیشرفته یادگیری ماشین و
            پردازش زبان طبیعی، دستیار صوتی چند‌منظوره‌ای را توسعه داده است که در
            جنبه‌های مختلف زندگی کاربرد دارد:
          </p>

          <ul className="list-disc list-inside space-y-2 mb-4">
            <li>هوشمند سازی خانه و محیط کار</li>
            <li>پشتیبانی آموزشی و تربیتی کودکان</li>
            <li>مدیریت امور مالی و بانکی</li>
            <li>پاسخگویی به سوالات تخصصی</li>
            <li>ارائه خدمات سرگرمی و موسیقی</li>
            <li>تسهیل فعالیت‌های روزمره و زندگی روزانه</li>
          </ul>

          <p>
            دستیار صوتی آریو، بیش از یک ابزار ساده است؛ این یک همراه دیجیتال
            قدرتمند است که به شما کمک می‌کند در هر حوزه‌ای که نیاز دارید، سریع و
            آسان به اطلاعات دسترسی پیدا کنید. این دستیار، به گونه‌ای طراحی شده
            است که به پروفایل‌های متنوعی متصل می‌شود: از خدمات پزشکی، مشاوره
            حقوقی، آموزش و ورزش گرفته تا هر حوزه دیگری که شما به آن نیاز دارید.
            این یعنی همیشه در کنار شماست، آماده است تا پاسخگو و راهنما باشد.
          </p>
        </div>

        <div className="my-12">
          <Image
            src="/images/aboutbottomspeaker.png"
            alt="Ario Smart Speaker"
            width={720}
            height={822}
            className="w-full md:h-[822px] h-[427px] object-cover rounded-2xl"
          />
        </div>

        <h3 className="title-sm-demibold text-gray-25 mt-8">
          امکانات و قابلیت‌ها
        </h3>

        <p className="text-lg-regular text-textTertiary mt-4">
          در کنار پاسخگویی دقیق و سریع، آریو می‌تواند خانه شما را هوشمند کند؛ از
          روشن و خاموش کردن لوازم خانگی، مدیریت سیستم‌های امنیتی و کنترل تجهیزات
          IOT گرفته تا فراهم کردن امکاناتی متناسب با نیازهای فردی هر کاربر.
          تمامی این فعالیت‌ها تنها با فرمان صوتی ساده قابل انجام است، و این
          راهکارها زندگی شما را ساده‌تر، ایمن‌تر و کارآمدتر می‌سازد.
        </p>

        <h3 className="title-sm-demibold text-gray-25 mt-8">تیم و تعهد ما</h3>

        <p className="text-lg-regular text-textTertiary mt-4">
          تیم متخصصان آریو متشکل از کارشناسان در حوزه‌های هوش مصنوعی، توسعه
          نرم‌افزار، طراحی تجربه کاربری و امنیت داده‌ها است که همیشه در پی
          نوآوری و توسعه فناوری‌هایی هستند که بتوانند نیازهای فردی و جامعه را
          برآورده کنند. ما به اهمیت حفظ حریم خصوصی و امنیت اطلاعات شما بسیار
          پایبندیم و تمامی فرآیندهای طراحی و توسعه محصول، بر پایه این ارزش‌ها
          استوار است.
        </p>

        <h3 className="title-sm-demibold text-gray-25 mt-8">آینده‌نگری</h3>

        <p className="text-lg-regular text-textTertiary mt-4">
          ما در آریو هم‌راستا با پیشرفت‌های فناوری، همیشه در حال بهبود و توسعه
          محصولات و خدمات خود هستیم. باور داریم فناوری باید در خدمت انسان باشد،
          و تلاش می‌کنیم فناوری‌های صوتی و هوشمند را به سطحی جدید و فراگیر
          برسانیم. ما شما را به همراهی در این سفر هیجان‌انگیز دعوت می‌کنیم تا
          تجربه‌ای متفاوت و متفاوت‌تر از تکنولوژی را در دستان خود احساس کنید.
        </p>
      </div>
    </section>
  );
}
